In [4]:
import pandas as pd
from pandas import Series, DataFrame

In [11]:
data = [4,7,-5,3]
index = ["한남","대학","평생","학습"]
pd_data = pd.Series(data)
pd_data2 = pd. Series(data,index)
print(pd_data2["대학"])

7

In [12]:
pd_data2[pd_data2>0]

한남    4
대학    7
학습    3
dtype: int64

In [13]:
pd_data2*2

한남     8
대학    14
평생   -10
학습     6
dtype: int64

In [14]:
"학습" in pd_data2

True

In [15]:
"빅데" in pd_data2

False

In [17]:
ser_data = {"ohio":35000,"texas":71000,"oregon":16000,"utah":5000}
pd_data3 = pd.Series(ser_data)
pd_data3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [18]:
ser_data = {"ohio":35000,"texas":71000,"oregon":16000,"utah":5000}
index = ["california","ohio","oregon","utah"]
pd_data4 = pd.Series(ser_data,index)
pd_data4

california        NaN
ohio          35000.0
oregon        16000.0
utah           5000.0
dtype: float64

In [20]:
pd.isnull(pd_data4)

california     True
ohio          False
oregon        False
utah          False
dtype: bool

In [21]:
pd.notnull(pd_data4)

california    False
ohio           True
oregon         True
utah           True
dtype: bool

In [22]:
pd_data4.name = "population"

In [23]:
pd_data4.index.name = "state"

In [24]:
pd_data4

state
california        NaN
ohio          35000.0
oregon        16000.0
utah           5000.0
Name: population, dtype: float64

In [33]:
data = {
    'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
    'year': ['2000','2001','2002','2001','2002','2003'],
    'pop': [ 1.5,1.7,3.6,2.4,2.9,3.2]
}
dframe1 = pd.DataFrame(data)
dframe1.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [35]:
dframe1.tail()

    state  year  pop
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [38]:
dframe2 = pd.DataFrame(data,
                       columns=['year','state','sales','pop'],
                       index = ["no1","no2","no3","no4","no5","no6"])
dframe2

     year   state sales  pop
no1  2000    ohio   NaN  1.5
no2  2001    ohio   NaN  1.7
no3  2002    ohio   NaN  3.6
no4  2001  nevada   NaN  2.4
no5  2002  nevada   NaN  2.9
no6  2003  nevada   NaN  3.2

In [39]:
dframe2['pop']

no1    1.5
no2    1.7
no3    3.6
no4    2.4
no5    2.9
no6    3.2
Name: pop, dtype: float64

In [45]:
dframe2.pop

<bound method DataFrame.pop of      year   state sales  pop
no1  2000    ohio   NaN  1.5
no2  2001    ohio   NaN  1.7
no3  2002    ohio   NaN  3.6
no4  2001  nevada   NaN  2.4
no5  2002  nevada   NaN  2.9
no6  2003  nevada   NaN  3.2>

In [46]:
dframe2.loc['no4']

year       2001
state    nevada
sales       NaN
pop         2.4
Name: no4, dtype: object

In [49]:
dframe2['sales'] = 0
dframe2

     year   state  sales  pop
no1  2000    ohio      0  1.5
no2  2001    ohio      0  1.7
no3  2002    ohio      0  3.6
no4  2001  nevada      0  2.4
no5  2002  nevada      0  2.9
no6  2003  nevada      0  3.2

In [55]:
dframe2['sales'] = pd.arange(6)
dframe2

AttributeError: module 'pandas' has no attribute 'arange'

In [52]:
dframe2['sales'] = [100,200,300,400,500,600]
dframe2

     year   state  sales  pop
no1  2000    ohio    100  1.5
no2  2001    ohio    200  1.7
no3  2002    ohio    300  3.6
no4  2001  nevada    400  2.4
no5  2002  nevada    500  2.9
no6  2003  nevada    600  3.2

In [61]:
index = ['no1','no2','no3','no4','no5','no6']
ser = pd.Series([100,200,300,400,500,600],index)
dframe2['sales'] = ser
dframe2

     year   state  sales  pop
no1  2000    ohio    100  1.5
no2  2001    ohio    200  1.7
no3  2002    ohio    300  3.6
no4  2001  nevada    400  2.4
no5  2002  nevada    500  2.9
no6  2003  nevada    600  3.2

In [62]:
index = ['no1','no2','no3','no4','no5','no6']
ser = pd.Series([100,200,300,400,500,600],index)
dframe2['additional'] = ser
dframe2

     year   state  sales  pop  additional
no1  2000    ohio    100  1.5         100
no2  2001    ohio    200  1.7         200
no3  2002    ohio    300  3.6         300
no4  2001  nevada    400  2.4         400
no5  2002  nevada    500  2.9         500
no6  2003  nevada    600  3.2         600

In [63]:
del dframe2['additional']
dframe2

     year   state  sales  pop
no1  2000    ohio    100  1.5
no2  2001    ohio    200  1.7
no3  2002    ohio    300  3.6
no4  2001  nevada    400  2.4
no5  2002  nevada    500  2.9
no6  2003  nevada    600  3.2

In [64]:
dframe2['pop']

no1    1.5
no2    1.7
no3    3.6
no4    2.4
no5    2.9
no6    3.2
Name: pop, dtype: float64

In [66]:
pop_data = {
    'nevada':{2001:2.4, 2002: 2.9},
    'ohio': {2000:1.5, 2001:1.7, 2002:3.6}
}
dframe2 = pd.DataFrame(pop_data)
dframe2

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [67]:
dframe2.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [68]:
dframe2 = pd.DataFrame(pop_data, index=[2000,2001,2002,2003])
dframe2

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [70]:
dframe2.index.name = 'year'
dframe2.columns.name = 'state'
dframe2

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN

In [72]:
dframe2.index

Int64Index([2000, 2001, 2002, 2003], dtype='int64', name='year')

In [73]:
dframe2.columns

Index(['nevada', 'ohio'], dtype='object', name='state')

In [74]:
dframe2.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6],
       [nan, nan]])

In [78]:
dframe2 = dframe2.reindex([2000,2001,2002])
dframe2

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [80]:
df4 = pd.Series(['blue','purple','yellow'],index = [0,2,4])
print(df4)
df5 = df4.reindex(index = [0,1,2,3,4],method='ffill')
print(df5)

0      blue
2    purple
4    yellow
dtype: object
0      blue
1      blue
2    purple
3    purple
4    yellow
dtype: object

In [81]:
df4 = pd.Series([100,300,500],index = [0,2,4])
print(df4)
df5 = df4.reindex(index = [0,1,2,3,4],method='ffill')
print(df5)

0    100
2    300
4    500
dtype: int64
0    100
1    100
2    300
3    300
4    500
dtype: int64

In [86]:
df5 = dframe2.reindex(columns = ["네바다","오하이오"])
df5

state  네바다  오하이오
year
2000   NaN   NaN
2001   NaN   NaN
2002   NaN   NaN

In [87]:
new_df5 = df5.drop(2001)
new_df5

state  네바다  오하이오
year
2000   NaN   NaN
2002   NaN   NaN